<a href="https://colab.research.google.com/github/NeefPoom/CP3-Poomi-Keaokao/blob/master/02_Exploratory_Data_Analysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import matplotlib.pyplot as plt

In [0]:
# read csv files from Github

url = 'https://raw.githubusercontent.com/thanachart/IntroBADS/master/Transactions_cleaned.csv'
df_transactions = pd.read_csv(url)
df_transactions.head(5)

   transaction_id  cust_id  tran_date  ...      Tax  total_amt  Store_type
0     29258453508   270384  20/2/2014  ...  785.925   8270.925      e-Shop
1     80712190438   270351  20/2/2014  ...  405.300   4265.300      e-Shop
2     58223423237   268138  17/2/2014  ...  440.370   4634.370      e-Shop
3     22643667930   271489  17/2/2014  ...  128.625   1353.625    TeleShop
4     79792372943   275108  17/2/2014  ...  286.020   3010.020         MBR

[5 rows x 10 columns]

# Checking data quality

In [0]:
#display a data type of each column

df_transactions.dtypes

#you will notice that tran_date is stored as an object, not datetime datatype

transaction_id        int64
cust_id               int64
tran_date            object
prod_subcat_code      int64
prod_cat_code         int64
Qty                   int64
Rate                  int64
Tax                 float64
total_amt           float64
Store_type           object
dtype: object

In [0]:
#we will convert tran_date into datetime column

df_transactions['tran_date'] = pd.to_datetime(df_transactions['tran_date'], errors='coerce')

df_transactions.dtypes

transaction_id               int64
cust_id                      int64
tran_date           datetime64[ns]
prod_subcat_code             int64
prod_cat_code                int64
Qty                          int64
Rate                         int64
Tax                        float64
total_amt                  float64
Store_type                  object
dtype: object

In [0]:
#let's see whether there is any missing value

df_transactions.isnull().sum()

transaction_id      0
cust_id             0
tran_date           0
prod_subcat_code    0
prod_cat_code       0
Qty                 0
Rate                0
Tax                 0
total_amt           0
Store_type          0
dtype: int64

# Describing data

In [0]:
df_transactions.describe()

       transaction_id        cust_id  ...          Tax    total_amt
count    2.057000e+03    2057.000000  ...  2057.000000  2057.000000
mean     5.060694e+10  270972.122022  ...   256.407193  2698.380455
std      2.920196e+10    2411.792750  ...   191.482363  2015.123916
min      8.712565e+07  266783.000000  ...     7.560000    79.560000
25%      2.535565e+10  268906.000000  ...   101.220000  1065.220000
50%      5.019010e+10  270864.000000  ...   206.010000  2168.010000
75%      7.691656e+10  273035.000000  ...   380.205000  4001.205000
max      9.998675e+10  275261.000000  ...   785.925000  8270.925000

[8 rows x 8 columns]

In [0]:
#how many store types?

df_transactions['Store_type'].drop_duplicates()

0             e-Shop
3           TeleShop
4                MBR
23    Flagship store
Name: Store_type, dtype: object

In [0]:
#how many products were sold?

df_transactions[['prod_subcat_code', 'prod_cat_code']].drop_duplicates()

    prod_subcat_code  prod_cat_code
0                  5              3
1                  1              1
2                  6              5
3                 12              6
4                  3              1
6                 11              6
7                  8              3
8                  4              4
10                 3              2
11                 1              2
13                 4              1
14                10              6
18                 4              2
23                10              3
25                 1              4
27                 2              6
29                 9              3
34                 3              5
37                12              5
40                 7              5
47                10              5
52                11              5
96                 4              3

In [0]:
#how many customers?

len(df_transactions['cust_id'].drop_duplicates())

1726

#